HTML_and_CSS_Design_and_Build_Websites/018.Process_and_Design/018.000.Notes.org
#+title: Chapter 18: Process & Design
#+author: Alfredo Mejia
#+options: num:nil html-postamble:nil
#+html_head: <link rel="stylesheet" type="text/css" href="../../resources/bulma/bulma.css" /> <style>body {margin: 5%} h1,h2,h3,h4,h5,h6 {margin-top: 3%}</style>

* Navigation                                                                                                                                                                                                          
| Nav   | Title                                  | Links                                   |
|-------+----------------------------------------+-----------------------------------------|
| Index | Notes Home                             | \vert [[file:../../index.html][html]] \vert [[file:../../index.org][org]] \vert [[https://github.com/alfredo-mejia/notes/tree/main][github]] \vert |
| Home  | HTML & CSS - Design and Build Websites | \vert [[file:../000.Home.html][html]] \vert [[file:../000.Home.org][org]] \vert [[https://github.com/alfredo-mejia/notes/tree/main/HTML_and_CSS_Design_and_Build_Websites][github]] \vert |
| Prev  | Chapter 17: HTML5 Layout               | \vert [[file:../017.HTML5_Layout/017.000.Notes.html][html]] \vert [[file:../017.HTML5_Layout/017.000.Notes.org][org]] \vert [[https://github.com/alfredo-mejia/notes/tree/main/HTML_and_CSS_Design_and_Build_Websites/017.HTML5_Layout][github]] \vert |
| Next  | Chapter 19: Practical Information      | \vert [[file:../019.Practical_Information/019.000.Notes.html][html]] \vert [[file:../019.Practical_Information/019.000.Notes.org][org]] \vert [[https://github.com/alfredo-mejia/notes/tree/main/HTML_and_CSS_Design_and_Build_Websites/019.Practical_Information][github]] \vert |

* Notes

** Section 18.1: Who is the Site For?
   - Every website should be designed for the target audience - not just for yourself or the site owner, thus it is important to understand who your target audience is
   - Realistically, it is unlikely that a website will be relevant for everyone
   - Questions to ask yourself when the target audience are individuals:
     - What is the age range of your target audience?
     - Will your site appeal to more women or men? What is the mix?
     - Which country do your visitors live in?
     - Do they live in urban or rural areas?
     - What is the average income of visitors?
     - What level of education do they have?
     - What is their marital or family status?
     - What is their occupation?
     - How many hours do they work per week?
     - How often do they use the web?
     - What kind of device do they use to access the web?
   - Questions to ask yourself when the target audiene are companies:
     - What is the size of the company or relevant department?
     - What is the position of people in the company who visit your site?
     - Will visitors be using the site for themselves or for someone else?
     - How large is the budget they control?
   - When making decisions or giving priorities, you ask yourself to look back at your audience and make decisions that make sense to your targeted audience

** Section 18.2: Why People Visit Your Website
   - Why are visitors coming to your website? Some will come across the website but most will visit for a specific reason
   - Your content and design should be influenced by the goals of your users
   - To help determine why people are coming to your website, there are two basic categories of questions you can ask:
     - The first attemps to discover the underlying *motivations* for why visitors come to the site
     - The second examines the specific *goals* of the visitors
   - The motivations and goals are the reason why users come to the site /now/
   - Questions regarding motivation of users:
     - Are they looking for general entertainment or do they need to achieve a specific goal?
     - If there is a specific goal is it a personal or professional one?
     - Do they see spending time on this activity as essential or a luxury?
   - Questions regarding goas for the users:
     - Do they want general information / research (such as background on a topic / company) or are they after something specific (such as a particular fact or information on a product)?
     - Are they already familiar with the service or product that you offer or do they need to be introduced to it?
     - Are they looking for time sensitive information, such as the latest news or updates on a particular topic?
     - Do they want to discover information about a specific product or service to help them decide whether to buy it or not?
     - Do they need to contact you? If so, can they visit in person (which might require opening hours and a map)? Or might they need email or telephone contact details?

