HTML_and_CSS_Design_and_Build_Websites/018.Process_and_Design/018.000.Notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-02-16 Sun 18:19 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Chapter 18: Process &amp; Design</title>
<meta name="author" content="Alfredo Mejia" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../../resources/bulma/bulma.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">Chapter 18: Process &amp; Design</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgc5e2651">Navigation</a></li>
<li><a href="#org2a9feeb">Notes</a>
<ul>
<li><a href="#org1aed6e6">Section 18.1: Who is the Site For?</a></li>
<li><a href="#orgf8844e1">Section 18.2: Why People Visit Your Website</a></li>
<li><a href="#org98ed95b">Section 18.3: What Are Your Visitors Trying to Achieve and What Information Do Your Visitors Need?</a></li>
<li><a href="#org017e00a">Section 18.4: How Often People Visit Your Site?</a></li>
<li><a href="#orgbc43865">Section 18.5: Site Maps</a></li>
<li><a href="#org314fccf">Section 18.6: Wireframes</a></li>
<li><a href="#orgaddfbca">Section 18.7: Getting Your Message Across Using Design</a></li>
<li><a href="#orgd760580">Section 18.9: Visual Hierarchy</a></li>
<li><a href="#org60f7bcc">Section 18.10: Grouping &amp; Similarity</a></li>
<li><a href="#org283f5ed">Section 18.11: Designing Navigation</a></li>
<li><a href="#org053caa3">Section 18.12: Summary</a></li>
</ul>
</li>
<li><a href="#orgd546f0d">Keywords</a></li>
<li><a href="#orgbee8599">Questions</a></li>
<li><a href="#org0745cb4">Summary</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgc5e2651" class="outline-2">
<h2 id="orgc5e2651">Navigation</h2>
<div class="outline-text-2" id="text-orgc5e2651">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Nav</th>
<th scope="col" class="org-left">Title</th>
<th scope="col" class="org-left">Links</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Index</td>
<td class="org-left">Notes Home</td>
<td class="org-left">&vert; <a href="../../index.html">html</a> &vert; <a href="../../index.html">org</a> &vert; <a href="https://github.com/alfredo-mejia/notes/tree/main">github</a> &vert;</td>
</tr>

<tr>
<td class="org-left">Home</td>
<td class="org-left">HTML &amp; CSS - Design and Build Websites</td>
<td class="org-left">&vert; <a href="../000.Home.html">html</a> &vert; <a href="../000.Home.html">org</a> &vert; <a href="https://github.com/alfredo-mejia/notes/tree/main/HTML_and_CSS_Design_and_Build_Websites">github</a> &vert;</td>
</tr>

<tr>
<td class="org-left">Prev</td>
<td class="org-left">Chapter 17: HTML5 Layout</td>
<td class="org-left">&vert; <a href="../017.HTML5_Layout/017.000.Notes.html">html</a> &vert; <a href="../017.HTML5_Layout/017.000.Notes.html">org</a> &vert; <a href="https://github.com/alfredo-mejia/notes/tree/main/HTML_and_CSS_Design_and_Build_Websites/017.HTML5_Layout">github</a> &vert;</td>
</tr>

<tr>
<td class="org-left">Next</td>
<td class="org-left">Chapter 19: Practical Information</td>
<td class="org-left">&vert; <a href="../019.Practical_Information/019.000.Notes.html">html</a> &vert; <a href="../019.Practical_Information/019.000.Notes.html">org</a> &vert; <a href="https://github.com/alfredo-mejia/notes/tree/main/HTML_and_CSS_Design_and_Build_Websites/019.Practical_Information">github</a> &vert;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org2a9feeb" class="outline-2">
<h2 id="org2a9feeb">Notes</h2>
<div class="outline-text-2" id="text-org2a9feeb">
</div>
<div id="outline-container-org1aed6e6" class="outline-3">
<h3 id="org1aed6e6">Section 18.1: Who is the Site For?</h3>
<div class="outline-text-3" id="text-org1aed6e6">
<ul class="org-ul">
<li>Every website should be designed for the target audience - not just for yourself or the site owner, thus it is important to understand who your target audience is</li>
<li>Realistically, it is unlikely that a website will be relevant for everyone</li>
<li>Questions to ask yourself when the target audience are individuals:
<ul class="org-ul">
<li>What is the age range of your target audience?</li>
<li>Will your site appeal to more women or men? What is the mix?</li>
<li>Which country do your visitors live in?</li>
<li>Do they live in urban or rural areas?</li>
<li>What is the average income of visitors?</li>
<li>What level of education do they have?</li>
<li>What is their marital or family status?</li>
<li>What is their occupation?</li>
<li>How many hours do they work per week?</li>
<li>How often do they use the web?</li>
<li>What kind of device do they use to access the web?</li>
</ul></li>
<li>Questions to ask yourself when the target audiene are companies:
<ul class="org-ul">
<li>What is the size of the company or relevant department?</li>
<li>What is the position of people in the company who visit your site?</li>
<li>Will visitors be using the site for themselves or for someone else?</li>
<li>How large is the budget they control?</li>
</ul></li>
<li>When making decisions or giving priorities, you ask yourself to look back at your audience and make decisions that make sense to your targeted audience</li>
</ul>
</div>
</div>

<div id="outline-container-orgf8844e1" class="outline-3">
<h3 id="orgf8844e1">Section 18.2: Why People Visit Your Website</h3>
<div class="outline-text-3" id="text-orgf8844e1">
<ul class="org-ul">
<li>Why are visitors coming to your website? Some will come across the website but most will visit for a specific reason</li>
<li>Your content and design should be influenced by the goals of your users</li>
<li>To help determine why people are coming to your website, there are two basic categories of questions you can ask:
<ul class="org-ul">
<li>The first attemps to discover the underlying <b>motivations</b> for why visitors come to the site</li>
<li>The second examines the specific <b>goals</b> of the visitors</li>
</ul></li>
<li>The motivations and goals are the reason why users come to the site <i>now</i></li>
<li>Questions regarding motivation of users:
<ul class="org-ul">
<li>Are they looking for general entertainment or do they need to achieve a specific goal?</li>
<li>If there is a specific goal is it a personal or professional one?</li>
<li>Do they see spending time on this activity as essential or a luxury?</li>
</ul></li>
<li>Questions regarding goas for the users:
<ul class="org-ul">
<li>Do they want general information / research (such as background on a topic / company) or are they after something specific (such as a particular fact or information on a product)?</li>
<li>Are they already familiar with the service or product that you offer or do they need to be introduced to it?</li>
<li>Are they looking for time sensitive information, such as the latest news or updates on a particular topic?</li>
<li>Do they want to discover information about a specific product or service to help them decide whether to buy it or not?</li>
<li>Do they need to contact you? If so, can they visit in person (which might require opening hours and a map)? Or might they need email or telephone contact details?</li>
</ul></li>
</ul>
</div>
</div>
