HTML_and_CSS_Design_and_Build_Websites/018.Process_and_Design/018.000.Notes.html

<div id="outline-container-org98ed95b" class="outline-3">
<h3 id="org98ed95b">Section 18.3: What Are Your Visitors Trying to Achieve and What Information Do Your Visitors Need?</h3>
<div class="outline-text-3" id="text-org98ed95b">
<ul class="org-ul">
<li>First create a list of reasons why people would be coming to your site</li>
<li>Then you can create fake users and assign the list of tasks / reasons of why they would come to your site to the fictional visitors you created</li>
<li>You know who is coming to your site and why they are coming, so now you need to work out what information they need in order to achieve their goals quickly and effectively</li>
<li>Look at each of the reasons why people will be visiting your site and determine what they need to achieve their goals</li>
<li>You can prioritize levels of information from key points down to non-essential or background information</li>
<li>By ensuring that you provide the information that your visitors are looking for, they will consider your site more revelant to them</li>
<li>Therefore, you will have more opportunity to tell them any extra information that you think would be helpful to them (or to expose them to other products and services you want to promote)</li>
<li>If you do not appear relevant to them by answering their needs, however, they are likely to go elsewhere</li>
<li>Here are some questions to help you decide what information to provide for visitors to your site
<ul class="org-ul">
<li>Will visitors be familiar with your subject area / brand or do you need to introduce yourself?</li>
<li>Will they be familiar with the product / service / information you are covering or do they need background information on it?</li>
<li>What are the most important features of what you are offering?</li>
<li>What is special about what you offer that differentiates you from other sites that offer something similar?</li>
<li>Once people have achieved the goal that sent them to your site, are there common questions people ask about this subject area?</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org017e00a" class="outline-3">
<h3 id="org017e00a">Section 18.4: How Often People Visit Your Site?</h3>
<div class="outline-text-3" id="text-org017e00a">
<ul class="org-ul">
<li>Some sites benefit from being updated more frequently than others, some information, such as news may be constantly changing, while other content remains relatively static</li>
<li>Once a site has been built, it can take a lot of time and resources to update it frequently</li>
<li>Working out how often people are likely to revisit your site gives you an indication for how often you should update the site</li>
<li>It can often be helpful to set a schedule for when a site will be updated rather than doing it on an ad-hoc basis</li>
<li>Here are some questions to help you decide how often to update your website content:
<ul class="org-ul">
<li>How often do the same people return to purchase from you?</li>
<li>How often is your stock updated or your service changed?</li>
<li>How often is the subject updated?</li>
<li>What percentage of your visitors would return for regular updates on the subject, compared with those who will jut need the information once?</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgbc43865" class="outline-3">
<h3 id="orgbc43865">Section 18.5: Site Maps</h3>
<div class="outline-text-3" id="text-orgbc43865">
<ul class="org-ul">
<li>Now that you know what needs to appear on your site, you can start to organize the information into sections of pages</li>
<li>The aim is to create a diagram of the pages that will be used to structure this site known as a <b>site map</b> and it will show how those pages can be grouped</li>
<li>To help you decide what information should go on each page, you can use a technique called card sorting</li>
<li>Card sorting involves placing each piece of information that a visitor might need to know on a separate piece of paper and then organizing the related information into groups</li>
<li>Each group relates to a page and on larger sites the pages can in turn be grouped together to create different sections of the website</li>
<li>The groups of information are then turned into the diagram that is known as the site map</li>
<li>Sometimes it can be helpful to ask people who are the target audiene to help you group related information together</li>
<li>A site map will usually begin with the homepage and if the site is large and is compartmentalized into sections then each section might require its own section homepage to link to all of the information within it</li>
<li>You may need to duplicate some information if it needs to appear on more than one page</li>
<li>The pages (or group of pages) will inform how users navigate through the site</li>
<li>Remember to focus on the goals that your visitors want to achieve</li>
</ul>
</div>
</div>

<div id="outline-container-org314fccf" class="outline-3">
<h3 id="org314fccf">Section 18.6: Wireframes</h3>
<div class="outline-text-3" id="text-org314fccf">
<ul class="org-ul">
<li>A wireframe is a simple sketch of the key information that needs to go on each page of a site, it shows the hierarchy of the information and how much space it might require</li>
<li>A lot of designers will take the elements that need to appear on each page and start by creating wireframes, this involves sketching or shading areas where each element on the page will go such as the logo, primary navigaion, headings and main bodies of text, user logins, etc.</li>
<li>By creating a wireframe you can ensure that all of the information that need to be on a page is included</li>
<li>You should not include the color scheme, font choices, backgrounds or images for the website in the wireframe, it should focus on what information needs to be on each page and create a visual hierarchy to indicate the most important parts of each page</li>
<li>It shows you where the information needs to be appear on before considering how the page should look</li>
<li>It would be very helpful to show the wireframe of a site to a client before showing them a design allowing the client ensure it has all the functions and information it needs to offer</li>
<li>Showing a wireframe to a client allows them to forget about design and just worry about information and function, the design will come later</li>
</ul>
</div>
</div>

<div id="outline-container-orgaddfbca" class="outline-3">
<h3 id="orgaddfbca">Section 18.7: Getting Your Message Across Using Design</h3>
<div class="outline-text-3" id="text-orgaddfbca">
<ul class="org-ul">
<li>The primary aim of any kind of visual design is to communicate, organizing and prioritizing information on a page helps user understand its importance and what order to read it in</li>
<li>There is so much content on a website that the designer needs to organize and prioritize the information to communicate their message and help users find what they're looking for</li>
<li>If everything had the same style it would make it much harder to understand so by making parts of the page look distinct from surrounding content, designers draw attention to or away from those items</li>
<li>Designers create something known as a <b>visual hierarchy</b> to help users focus on the key messages that will draw people's attention and then guide them to subsequent messages (more about it later)</li>
<li>Grouping together related content into blocks or chunks makes the page look simpler and easier to understand</li>
<li>Users should be able to identify the purpose of each block without procesing each item and by presenting certain types of information in a similar visual style (e.g. same style for all buttons or all links) users will learn to associate that style with a particular type of content (more about it later)</li>
</ul>
</div>
</div>
