HTML_and_CSS_Design_and_Build_Websites/018.Process_and_Design/018.000.Notes.org
** Section 18.9: Visual Hierarchy
   - Most users do not read entire pages but skim to find information, thus you can create contrast to create a visual hierarchy that gets across your key message and helps users find what they are looking for
   - Size: Larger elements will grab users' attention first and it is a good idea to make headings and key points relatively large
   - Color: Foreground and background color can draw attention to key messages and brighter sections tend to draw users' attention first
   - Style: An element may be the same size and color as surrounding content but have a different style applied to it to make it stand out
   - Visual hierarchy refers to the order in which your eyes perceive what they see and it is created by adding visual contrast between the items being displayed as items with higher contrast are recognized and processed first
   - Images create a high visual contrast and often attract the eye first and images can be used to draw attention to a specific message within the page
   - A site has to achieve balance, if nothing stands out the site is boring, if everything stands out then the key messages may be missed

** Section 18.10: Grouping & Similarity
   - When making sense of a design, we tend to organize visual elements into groups thus grouping related pieces of information together can make a design easier to comprehend
   - Here are some ways this can be achieved:
     - Proximity: Several items placed close together are perceived as more related than items that are placed further apart
     - Closure: When working with a complicated arrangement of items a real or imaginary box can be formed around the elements due to their proximity and alignment
     - Continuance: When elements are placed in a line or curve then they are perceived to be more related than those that are not following the same direction (this can be used to direct a reader from one part of a page to the next)
     - White Space: Placing related items closer together and leaving a bigger gap between unrelated items
     - Color: A background color placed behind related items to emphasize their connection
     - Borders: A line can be drawn around the border of the group or between and its neighbors
   - We naturally observe similarities in design, and the things that are similar are perceived to be more related than things that are dissimilar
   - Repetition of similar color, size, orientation, texture, font, or shape, suggests that matching elements have similar importance or meaning
   - There can also have nested groups of information within larger groups of information
   - Giving a chunk of information a heading clearly tells the user whether or not the content of the groupings is relevant to them, if not they can ignore all of the elements within it (plus it might help users with screen readers hear the headings of the groupings and skip it if it is irrelevant to them)
   - Each visual chunk can contain its own hierarchy (e.g. title -> author -> text -> link)

** Section 18.11: Designing Navigation
   - Site navigation not only helps people find where they want to go but also helps them understand what your site is about and how it is organzied
   - Good navigation tends to follow these principles:
     - Concise: Navigation should be quick and easy to read (limit your options and no more than eight links)
     - Clear: Users should be able to predict the kind of information that they will find on the page before clicking on the link (choose single descriptive words for each link rather than phrases)
     - Selective: Primary navigation should only reflect the sections or content of the site (functions like login, search, legal information, etc. are best to be placed elsewhere on the page)
   - Some primary navigation may have a secondary navigation under the primary navigation, the footer may have a tertiary navigation, and there may be links throughout the site so the main navigation may not be the only way the user navigates the site
   - Some sites might even have a search function
   - Good navigation provides context which lets the user know where they are in the website at that moment using a differnet color or some kind of visual marker to indicate the current page
   - Each link should be big enough to click on and the appearance of the link should change when the user hovers each item or when it is clicked on plus it should be visually distinct from other content of the page to tell users that is the navigation and it is clickable
   - The more pages a site contains, the larger the number of navigation items there will be and it is best to keep the primary navigation exactly the same to have consistency

** Section 18.12: Summary
   - It is important to understand who your target audience is, why they would come to your site, what information they want to find and when they are likely to return
   - Site maps allow you to place the structure of a site
   - Wireframes allow you to organize the information that will need to go on each page
   - Design is about communiccation and visul hierarchy helps visitors understand what you are trying to tell them
   - You can differentiate between pieces of information using size, color, and style
   - You can use grouping and similarity to help simplify the information you present
   
