HTML_and_CSS_Design_and_Build_Websites/018.Process_and_Design/018.000.Notes.html

<div id="outline-container-orgd760580" class="outline-3">
<h3 id="orgd760580">Section 18.9: Visual Hierarchy</h3>
<div class="outline-text-3" id="text-orgd760580">
<ul class="org-ul">
<li>Most users do not read entire pages but skim to find information, thus you can create contrast to create a visual hierarchy that gets across your key message and helps users find what they are looking for</li>
<li>Size: Larger elements will grab users' attention first and it is a good idea to make headings and key points relatively large</li>
<li>Color: Foreground and background color can draw attention to key messages and brighter sections tend to draw users' attention first</li>
<li>Style: An element may be the same size and color as surrounding content but have a different style applied to it to make it stand out</li>
<li>Visual hierarchy refers to the order in which your eyes perceive what they see and it is created by adding visual contrast between the items being displayed as items with higher contrast are recognized and processed first</li>
<li>Images create a high visual contrast and often attract the eye first and images can be used to draw attention to a specific message within the page</li>
<li>A site has to achieve balance, if nothing stands out the site is boring, if everything stands out then the key messages may be missed</li>
</ul>
</div>
</div>

<div id="outline-container-org60f7bcc" class="outline-3">
<h3 id="org60f7bcc">Section 18.10: Grouping &amp; Similarity</h3>
<div class="outline-text-3" id="text-org60f7bcc">
<ul class="org-ul">
<li>When making sense of a design, we tend to organize visual elements into groups thus grouping related pieces of information together can make a design easier to comprehend</li>
<li>Here are some ways this can be achieved:
<ul class="org-ul">
<li>Proximity: Several items placed close together are perceived as more related than items that are placed further apart</li>
<li>Closure: When working with a complicated arrangement of items a real or imaginary box can be formed around the elements due to their proximity and alignment</li>
<li>Continuance: When elements are placed in a line or curve then they are perceived to be more related than those that are not following the same direction (this can be used to direct a reader from one part of a page to the next)</li>
<li>White Space: Placing related items closer together and leaving a bigger gap between unrelated items</li>
<li>Color: A background color placed behind related items to emphasize their connection</li>
<li>Borders: A line can be drawn around the border of the group or between and its neighbors</li>
</ul></li>
<li>We naturally observe similarities in design, and the things that are similar are perceived to be more related than things that are dissimilar</li>
<li>Repetition of similar color, size, orientation, texture, font, or shape, suggests that matching elements have similar importance or meaning</li>
<li>There can also have nested groups of information within larger groups of information</li>
<li>Giving a chunk of information a heading clearly tells the user whether or not the content of the groupings is relevant to them, if not they can ignore all of the elements within it (plus it might help users with screen readers hear the headings of the groupings and skip it if it is irrelevant to them)</li>
<li>Each visual chunk can contain its own hierarchy (e.g. title -&gt; author -&gt; text -&gt; link)</li>
</ul>
</div>
</div>

<div id="outline-container-org283f5ed" class="outline-3">
<h3 id="org283f5ed">Section 18.11: Designing Navigation</h3>
<div class="outline-text-3" id="text-org283f5ed">
<ul class="org-ul">
<li>Site navigation not only helps people find where they want to go but also helps them understand what your site is about and how it is organzied</li>
<li>Good navigation tends to follow these principles:
<ul class="org-ul">
<li>Concise: Navigation should be quick and easy to read (limit your options and no more than eight links)</li>
<li>Clear: Users should be able to predict the kind of information that they will find on the page before clicking on the link (choose single descriptive words for each link rather than phrases)</li>
<li>Selective: Primary navigation should only reflect the sections or content of the site (functions like login, search, legal information, etc. are best to be placed elsewhere on the page)</li>
</ul></li>
<li>Some primary navigation may have a secondary navigation under the primary navigation, the footer may have a tertiary navigation, and there may be links throughout the site so the main navigation may not be the only way the user navigates the site</li>
<li>Some sites might even have a search function</li>
<li>Good navigation provides context which lets the user know where they are in the website at that moment using a differnet color or some kind of visual marker to indicate the current page</li>
<li>Each link should be big enough to click on and the appearance of the link should change when the user hovers each item or when it is clicked on plus it should be visually distinct from other content of the page to tell users that is the navigation and it is clickable</li>
<li>The more pages a site contains, the larger the number of navigation items there will be and it is best to keep the primary navigation exactly the same to have consistency</li>
</ul>
</div>
</div>

<div id="outline-container-org053caa3" class="outline-3">
<h3 id="org053caa3">Section 18.12: Summary</h3>
<div class="outline-text-3" id="text-org053caa3">
<ul class="org-ul">
<li>It is important to understand who your target audience is, why they would come to your site, what information they want to find and when they are likely to return</li>
<li>Site maps allow you to place the structure of a site</li>
<li>Wireframes allow you to organize the information that will need to go on each page</li>
<li>Design is about communiccation and visul hierarchy helps visitors understand what you are trying to tell them</li>
<li>You can differentiate between pieces of information using size, color, and style</li>
<li>You can use grouping and similarity to help simplify the information you present</li>
</ul>
</div>
</div>
</div>
