HTML_and_CSS_Design_and_Build_Websites/018.Process_and_Design/018.000.Notes.html

<div id="outline-container-orgd546f0d" class="outline-2">
<h2 id="orgd546f0d">Keywords</h2>
<div class="outline-text-2" id="text-orgd546f0d">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Term</th>
<th scope="col" class="org-left">Definition</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Visual Site Map</td>
<td class="org-left">A site map and a visual site map are slightly two different things. A site map is a file while a visual site map is a diagram tat shows  how a webites pages are structured and connected being able to plot out your website's architecture and relationships allows you to analyze the current state of your website and plans for future needs (according to a <a href="https://www.lucidchart.com/blog/7-unexpected-ways-to-use-sitemaps#:~:text=A%20visual%20sitemap%20represents%20the,and%20plan%20for%20future%20needs.">Lucid Chart blog post</a>)</td>
</tr>

<tr>
<td class="org-left">Card Sorting</td>
<td class="org-left">Carding sorting is a UX research technique where users are asked to organize a set of content labels (e.g. an e-commcerce will give the labels such as shoes, sweaters, t-shirts, etc.) into categories, providing insights into how they would naturally group information on a website and using these insights it can help designers the placement of information in your website and thus create an information architecture which goes in hand with site maps and wireframes</td>
</tr>

<tr>
<td class="org-left">Wireframe</td>
<td class="org-left">A wireframe is a basic visual representation of a website or app's layout, like its blueprint that shows how content, information, features, and functions will be arranged but <b>without</b> detailed design elements such as color, fonts, etc.</td>
</tr>

<tr>
<td class="org-left">Visual Hierarchy</td>
<td class="org-left">Visual hierarchy refers to the arrangement or organization of elements within a web design in a way that guides the viewer's eye through the content in a specifc order of important helping users quickly understand what's most important and where to look next according to hte <a href="https://www.interaction-design.org/literature/topics/visual-hierarchy#:~:text=Visual%20hierarchy%20refers%20to%20the,and%20understand%20the%20information%20presented.">Interaction Design Foundation</a></td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgbee8599" class="outline-2">
<h2 id="orgbee8599">Questions</h2>
<div class="outline-text-2" id="text-orgbee8599">
<ul class="org-ul">
<li><b>Q</b>: What is a site map file?
<ul class="org-ul">
<li>According to <a href="https://developers.google.com/search/docs/crawling-indexing/sitemaps/overview">Google Docs</a> a sitemap is a file where you provide information about the pages, videos, and other files on your site and the relationships between them</li>
<li>A sitemap allows web-crawlers (search engines) to crawl your site more efficiently and tells the search engines which pages and files you think are important in your site</li>
<li>To build a site map according to <a href="https://developers.google.com/search/docs/crawling-indexing/sitemaps/build-sitemap">Google Docs</a> you'll need a file with a specific format, there are 3 formats and Google does not have a preference but recommends to follow the <a href="https://www.sitemaps.org/protocol.html">sitemaps protocol</a></li>
</ul></li>
</ul>
</div>
</div>
