HTML_and_CSS_Design_and_Build_Websites/018.Process_and_Design/018.000.Notes.html

<div id="outline-container-org0745cb4" class="outline-2">
<h2 id="org0745cb4">Summary</h2>
<div class="outline-text-2" id="text-org0745cb4">
<ul class="org-ul">
<li>Every website should be designed for the target audience (not the owner or developer)</li>
<li>Questions to ask if targeted audience are individuals: what is the age, gender / sex, area of residency, income, education, occupation, and what device do they use</li>
<li>Questions to ask if targeted audience are companies: budget of company, which department is interested in this website, size of company, and will the individual visiting the website being using it for themselves (they themselves making the decision) or for someone else (someone else make the decisions)</li>
<li>After you have identified your target audience you have to figure out the motivation and goals of your audience</li>
<li>What are they looking for in the website, what do they expect to find, do they want general or specific information, are they familiar with your subject area, do they need to contact you, etc.</li>
<li>Figure out why they wanted to visit your website and what do they want to get out of your website</li>
<li>After you find out possible reasons, create user personas (fictional representation of your user) and try to list information that the website will need such as info your users are expecting and if necessary extra information that may be helpful for your users</li>
<li>Once you have the information the website will need you can do some card-sorting which organzies information into categories</li>
<li>Once you have your categories of infomration then you create a visual site map to compartmentalize your information into separate pages thus creating an information hierarchy (e.g. home page is the generic info, contact page is the contact info, etc.)</li>
<li>Each site must have the information the users expects and is trying to find at the end all we want to do is help our visitors achieve their goal of why did they come to the website in the first place</li>
<li>Once you have a site map you can create a wireframe which is a simple ketch of the key information that needs to go on each page of a site, it shows the hierarchy of information, where the information will be placed, where the features and functions will be placed, basically ensures all the information has a place and is included on the design, a wireframe is not concerned with the visual elements such as color, fonts, etc.</li>
<li>Showing wireframes to a client could be beneficial because it tells them where the information will be placed allowing the client to focus on the information and not on the visual aspect</li>
<li>Web designers need to organzie and prioritize information to communicate thier message and help users find what they're looking for</li>
<li>Designers create a visual heirarchy to help users focus on the key messages that will draw people's attention and guide them to subsequest critical information for that user</li>
<li>To create a visual hierarchy, designers use size to grab the users' attention with large headings, color is also used to draw attention to key messages by using brighter sections, and style is another form to create visual hierarchy to make different stylized content stand out</li>
<li>Images create a visual high contrast and often attract the eye so images are good to use when needed but the goal for a site is to achieve a well balanced visual hierarchy</li>
<li>In addition, you can group elements to create a visual hierarchy, you can group elements based on proximity, closure, continuance, white space, color, borders, etc. because we humans naturally observe similiarities in design and things that are similar are perceived to be more related to each other than things that are dissimilar</li>
<li>Each chunk of information can be given a header and the user can easily read if the info is relevant to them, otherwise it may skip the whole info chunk</li>
<li>Within each chunk of infomration, it may have a nested visual hierarchy as well</li>
<li>Another important part is designing a navigation, the navigation must be concise (easy to read and not many links), clear (single descriptive words for each link), and selective (links the reflect the main content of the site)</li>
<li>Finally, as a developer you have to consider if the website we'll need updates or not, it is best to update a website following a schedule than updating a website as it needs</li>
</ul>
</div>
</div>
</div>
</body>
</html>
